RizzoTheSmall/Dinky/hardware/dinky/dinky/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Arduino Zero (Prorgamming Port)
# ---------------------------------------
dinky.name=Dinky
dinky.vid.0=0x8BAD
dinky.pid.0=0xBEEF

dinky.upload.tool=bossac
dinky.upload.protocol=sam-ba
dinky.upload.maximum_size=262144
dinky.upload.maximum_data_size=32768
dinky.upload.use_1200bps_touch=true
dinky.upload.wait_for_upload_port=true
dinky.upload.native_usb=true

dinky.build.mcu=cortex-m0plus
dinky.build.f_cpu=48000000L
dinky.build.usb_product="Dinky"
dinky.build.usb_manufacturer="Rob Hardy"
dinky.build.board=SAMD_ZERO
dinky.build.core=arduino
dinky.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS {build.usb_flags}
dinky.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dinky.build.openocdscript=openocd_scripts/dinky.cfg
dinky.build.variant=dinky
dinky.build.variant_system_lib=
dinky.build.vid=0x8BAD
dinky.build.pid=0xBEEF

dinky.bootloader.tool=openocd
dinky.bootloader.file=dinky/samd21_sam_ba.bin